//addOverlayListener('onLogEvent',function(e){
//for(leti=0;i<e.detail.logs.length;i++){
//console.log(e.detail.logs[i]);
//}
//});

addOverlayListener('EnmityTargetData', (e) => target(e));
addOverlayListener('onZoneChangedEvent', (e) = function(e)
{
    console.log("oneZoneChangedEvent:" + e);
})
startOverlayEvents();
var Name2Dictionaries = {
    "鬼哭队调查队长": "说明文字",
    "木人": "歪比歪比",
    "地宫死亡鼠": "视觉感知",
    "地宫羚羊": "视觉感知",
    "地宫黄蜂": "靠近感知",
    "地宫元精": "靠近感知",
    "地宫黄蜂": "靠近感知",
    "地宫元精": "靠近感知",
    "地宫盲头蟹": "声音感知",
    "地宫粘液怪": "靠近感知",
    "地宫眼镜蛇": "视野感知",
    "地宫软糊怪": "靠近感知",
    "地宫魔界花": "靠近感知",
    "地宫大口花": "靠近感知",
    "地宫幼苗": "靠近感知",
    "地宫弥诺陶洛斯": "视觉感知",
    "地宫斯卡尼特": "靠近感知",
    "地宫乌洛里石": "靠近感知",
    "地宫犀蜴": "靠近感知",
    "地宫无头骑士": "声音感知",
    "噩梦百目妖": "靠近感知",
    "噩梦梦魔": "视觉感知",
    "噩梦假面": "视觉感知",
    "噩梦幽灵": "视觉感知",
    "噩梦墓穴守卫": "声音感知",
    "地宫魔力罐": "靠近感知",
    "地宫小魔精": "靠近感知",
    "地宫石像魔": "靠近感知",
    "地宫笠头螈": "靠近感知",
    "地宫三角龙": "靠近感知",
    "地宫无齿翼龙": "靠近感知",
    "地宫大脚巨猿": "靠近感知",
    "地宫爆弹怪": "视觉感知 如果你没有及时击杀它，他会自爆",
    "地宫瓦魔蛾幼虫": "听觉感知",
    "地宫巨虫": "听觉感知",
    "地宫毛虫": "听觉感知",
    "地宫骏鹰": "视觉感知",
    "地宫墓穴守卫": "声音感知",
    "深宫黄蜂": "靠近感知",
    "地宫盲头蟹": "靠近感知",
    "地宫元精为": "靠近感知",
    "深宫巨蟾蜍": "视觉感知",
    "深宫粘液怪": "靠近感知",
    "深宫眼镜蛇": "视觉感知",
    "深宫魔界花": "靠近感知",
    "地宫大口花": "靠近感知",
    "深宫弥诺陶洛斯": "视觉感知 会放钢铁，眩晕打断",
    "深宫斯卡尼特": "靠近感知",
    "深宫乌洛里石": "靠近感知",
    "深宫犀蜴": "靠近感知",
    "地宫无头骑士": "声音感知",
    "深宫冥鬼之眼": "视觉感知",
    "深宫百目妖": "靠近感知",
    "深宫恶魔": "视觉感知 会大漩涡，清空你的HP",
    "深宫石像鬼": "视觉感知 很痛，DPS需要者秘药/强化防御",
    "深宫曼提克": "视觉感知 真的很疼，别招惹",
    "深宫幽灵": "靠近感知 AOE尖啸会让你被迫走进房间，从而可能就会踩到陷阱或拉到怪不过你可以眩晕和沉默它",
    "深宫假面": "靠近感知",
    "深宫守卫": "声音感知",
    "深宫魔力罐": "靠近感知 有顺劈连击，注意他们的大伤害，必要时记得用生者秘药",
    "深宫深瞳": "视觉感知 有顺劈连击，注意他们的大伤害，必要时记得用生者秘药",
    "深宫马洛里石": "靠近感知 有顺劈连击，注意他们的大伤害，必要时记得用生者秘药",
    "深宫上级恶魔": "靠近感知",
    "深宫三角龙": "靠近感知 有顺劈，而且很疼",
    "深宫中音巨鳄": "视觉感知 有顺劈，而且很疼",
    "深宫笠头螈": "靠近感知",
    "深宫无齿翼龙": "靠近感知",
    "深宫斑攫兽": "视觉感知 顺劈/连击",
    "深宫雄狮": "视觉感知 顺劈/连击",
    "深宫白狼": "视觉感知 很疼，非常不建议打",
    "深宫文森野牛": "视觉感知 如果没有通过30s的DPSCHECK，会吸引你并附加95%减速，之后会以自身为中心释放秒杀级大范围aoe可防击退",
    "深宫独眼雪巨人": "视觉感知 怒视是正面直线AOE，百吨回转是钢铁",
    "深宫大脚巨猿": "靠近感知 最好有强化防御再打",
    "深宫妖鸟": "视觉感知 顺劈很疼，加速读条可打断",
    "深宫安祖": "视觉感知 绝对不能打!!!",
    "深宫瓦魔蛾幼虫": "靠近感知 如果要打请一定要注意血线，最好有一个可以风筝的房间",
    "深宫风巨魔": "视觉感知 没有威胁",
    "深宫巨钳虾": "视觉感知 吸引～顺劈～螺旋尾的循环，有强化防御会好打很多",
    "深宫洪水巨虫": "声音感知 强烈不建议打的怪",
    "深宫毛爬虫": "声音感知 绝对不能打",
    "水龙": "视觉感知 绝对不能打",
    "深宫加姆": "靠近感知 雷电靠近、寒冰远离，可插言或伤头打断。",
    "深宫元精": "靠近感知 如果你用妨碍陷阱沉默它，那么它就会原地罚站",
    "深宫木乃伊": "靠近感知",
    "地宫木乃伊": "靠近感知",
    "深宫寒冰陷阱草": "声音感知 轻松",
    "奥尼克斯龙": "靠近感知 不可眩晕，基础伤害高，但窗口期也多，是用于开门的怪。",
    "深宫骏鹰": "视觉感知 一般不用打它，如果你不用强化防御打它，压力会非常大，请务必留一个房间风筝。",
    "深宫铁面腐尸": "靠近感知 在没有强化防御时绝对不能打它。",
    "深宫贪吃鬼": "靠近感知 没有强化防御时不建议打。如果它堵路了，建议使用天使。",
    "深宫幽鬼之眼": "视觉感知 有一个前方无范围提示的AOE，5级即死",
    "深宫骑士": "靠近感知 无强化防御不能打。即使用强化防御也要风筝和不断自奶。不会被天使眩晕，用天使时需要预判放置aoe。",
    "深宫幽灵": "靠近感知 基础伤害很高。请留出一个房间用于躲避其大范围aoe。",
    "深宫守卫": "声音感知 除非你和它撞脸、贴的很近，不然只要你切走路他就不会打你。不会被天使眩晕",
    "地宫死亡凝视": " 使用魔陶器梦魔化在低层可以造成巨量伤害，这是因为易伤的潜在价值比大部分低级技能都要高。如果你的职业可以风筝BOSS，那你可以绕着场地边缘跑来躲掉的爆裂尾。",
    "大口花": " 使用魔陶器梦魔化来击杀BOSS和他召唤出的小怪(在它召唤时对着BOSS使用，可以通过AOE同时打到BOSS和小怪)。需要注意的是单人时可以使用生者秘药，它的伤害还是很高的。",
    "宁吉兹济达": " 站在场边，引导火球-冰球-火球-冰球，走到场地中央",
    "伊休妲": " 杀完小怪",
    "漆黑的艾达": " 贴紧boss来躲环形AOE身体健康。如果你正确处理每个机制，这个boss会很简单。他会释放两种身体健康，一种将要求你远离她，另一种将覆盖整个战斗区域除去她身下的一个小区域。因此请尽量靠近她来避开这个技能。这个技能除了本身的伤害之后，每个被此技能击中的敌人都会点亮一个地板上的符文，这会增加全屏AOE冥婚蜜月的伤害。除此之外，她有时会释放病入膏肓，它会立即对目标造成病弱DEBUFF，但由于她的技能释放顺序，你永远不必担心因为病弱的速度减缓而难以躲避身体健康。",
    "深黑骑士": " 记得卡位，保证被点名击退后不要飞进持续地板AOE。",
    "水虎龙亚夸虏": " 当boss吟唱浸泡时，把他完全拉出范围，否则他会得到加速BUFF。",
    "古丹纳": " 远离boss施放的旋风，他们会将略大于他们视觉范围的人吸入并造成伤害。他会在边缘施放会施加易伤的大伤害AOE呵斥，所以当他跑去边缘时，一起跟着跑过去。他的HP在18%之后就会不断吟唱黄道陨石，一发就能造成你最大血量80%的伤害。因此，把爆发留到这个时候并尽快RUSH掉它。",
    "爆弹怪教母": " 把橘色小怪直接打死，把蓝色小怪推到boss边",
    "死灵术士尼博斯": " 用魔陶器强化自身、魔陶器强化防御、生者秘药和魔陶器梦魔化，大胆的用虚空烈焰怼boss吧，他会小怪焚化殆尽。变身时间结束后，再用一个生者秘药和魔陶器基路伯化，用天罚怼爆BOSS和地上的小怪。",
    "阿利坎托": " 锤人疼,没了",
    "荣光魔花": " 躲开AOE，杀死小蜜蜂",
    "埃尔法德": " 站在场边，引导火球-冰球-火球-冰球，跑到中间。",
    "阿普切": " 魔陶器强化自身+魔陶器强化防御+魔陶器基路伯化套餐。你也可以不用魔陶器强化防御，那你可能就需要手动解除基路伯状态，吃个生者秘药，再用另一个魔陶器基路伯化。",
    "提西福涅": " 风筝并杀死僵尸小怪(不要让他们摸到你)，梦魔小怪不是必须杀死的。",
    "非生骑士": " 建议你提前用一个魔陶器强化防御。不要踩进流血区域。",
    "虹蛇": " 在第一个沉重效果慢慢衰减时预留一个疾跑或打断，这是因为你需要用这个来逃过随之而来的生物电AOE(在沉重还有7秒时用疾跑)。",
    "丹代恩索涅": " 如果你有时间的话最好不要用魔陶器梦魔化",
    "爆弹怪教父": " 杀死蓝色爆弹怪(治疗爆弹怪)并把红色爆弹怪(熔岩爆弹怪)打到boss边。注意如果你被地面爆破打到或蓝色爆弹怪炸到，你会被冻住，你没有魔陶器强化防御的话基本就死了。",
    "地宫宁基南加": "靠近感知",
    "地宫南加": "靠近感知",
}

window.onload = function()
{
    document.body.hidden = true;
    document.getElementById("btn-test").onclick = btnFunc;
}

function btnFunc()
{

    let in_act_combat = Advanced_Combat_Tracker.ActGlobals.oFormActMain.InCombat;
    console.log(in_act_combat);
    console.log("click!");
}

function target(e)
{
    let targetName = document.getElementById("target-name");
    let targetProperties = document.getElementById("target-properties");
    if (e.Target == null)
    {
        document.body.hidden = true;
    }
    else
    {
        document.body.hidden = false;
        targetName.innerText = `${e.Target.Name} (${(e.Target.ID).toString(16).toUpperCase()})`;
        targetProperties.innerText = (Name2Dictionaries[e.Target.Name] == undefined) ? '' : Name2Dictionaries[e.Target.Name];
    }
}